// Scanner классыг эхлээд импортолно.
import java.util.Scanner;

public class InputDemo1
{
    // Программ эхлүүлэх функцээ эхлээд бичье.
    public static void main(){
        // Scanner классын объектыг үүсгэе.
        Scanner sc = new Scanner(System.in);
        // Scanner бол sc нэртэй объектын класс төрөл
        // sc - объектын нэр, дурын нэр зарлаж болно.
        // new - объект үүсгэх түлхүүр үг
        // Scanner(System.in) - энэ бол Scanner классын байгуулагч функц
        
        // Одоо оролтын утгыг хадгалах хувьсагч зарлая.
        String name;
        // тэмдэгт мөр төрөлтэй утга авч үзье.
        // Консол дээр ямар утга оруулах ёстойг нь зааварчилсан тайлбар бичье.
        System.out.println("Та нэрээ оруулна уу:");
        name = sc.nextLine();
        System.out.println("Таны нэр: " + name);
        // Одоо кодоо компайлдаад ажиллуулж үзье.
        
        // оролтын объектоо ашиглан дахин утга авч болно.
        int x;
        System.out.println("Таны нас:");
        x = sc.nextInt();
        System.out.println("Таны нас бол: " + x);
        
        // Бусад төрлийн утгуудын зориулалтын функцийг нь ашиглан туршиж үзээрэй.
    }
}
